Feature/system design doc (#5)
* feat: add documentation for Database Sharding and Microservice Architecture

* feat: add mermaid theme and update favicon/logo SVGs

- Added "@docusaurus/theme-mermaid" dependency to package.json.
- Created a new favicon.svg with a gradient design and book illustration.
- Updated logo.svg to include a new design featuring a brain and neural network elements, enhancing the visual representation of AI concepts.
